Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# CapturedOutput.ClearAccessibility
source: Clear
de: Leeren
ja: クリア
pt_br: Limpar
ru: Очистить
zh_hans: 清除

# CapturedOutput.ToggleCheckmark
source: Toggle Checkmark
de: Häkchen umschalten
ja: チェックマークを切り替え
pt_br: Alternar marca de seleção
ru: Переключить отметку
zh_hans: 切换对勾

# ChatAgent.AttachedFile
source: [Attached file]
de: [Angehängte Datei]
ja: [添付ファイル]
pt_br: [Arquivo anexado]
ru: [Прикреплённый файл]
zh_hans: [附件文件]

# ChatAgent.AutoProvideBody
source: iTerm2 can include this session’s visible screen and terminal state with every message you send in AI chats where you’ve allowed it, so the assistant sees what you see. You can turn this off any time from a chat’s permission settings.
de: iTerm2 kann den sichtbaren Bildschirminhalt und Terminalstatus dieser Sitzung bei jeder Nachricht mitsenden, die Sie in KI-Chats senden, in denen Sie dies erlaubt haben, damit der Assistent sieht, was Sie sehen. Sie können dies jederzeit in den Berechtigungseinstellungen eines Chats deaktivieren.
ja: iTerm2 では、許可した AI チャットで送信するすべてのメッセージに、このセッションの表示中の画面とターミナルの状態を含めることができます。これにより、アシスタントはあなたが見ているものを把握できます。この設定はいつでもチャットの権限設定からオフにできます。
pt_br: O iTerm2 pode incluir a tela visível e o estado do terminal desta sessão em cada mensagem que você envia nos chats de IA onde você permitiu, para que o assistente veja o que você vê. Você pode desativar isso a qualquer momento nos ajustes de permissão de um chat.
ru: iTerm2 может включать видимый экран и состояние терминала этой сессии в каждое сообщение, которое вы отправляете в чатах с ИИ, где вы это разрешили, чтобы ассистент видел то же, что и вы. Вы можете отключить это в любой момент в настройках разрешений чата.
zh_hans: iTerm2 可以在你允许的 AI 聊天中，将每条消息附带该会话的可见屏幕和终端状态，以便助手看到你所看到的内容。你可以随时在聊天的权限设置中关闭此功能。

# ChatAgent.AutoProvideHeading
source: Share Terminal Contents Automatically?
de: Terminalinhalte automatisch teilen?
ja: ターミナルの内容を自動的に共有しますか？
pt_br: Compartilhar o conteúdo do terminal automaticamente?
ru: Автоматически делиться содержимым терминала?
zh_hans: 自动共享终端内容？

# ChatAgent.NotNow
source: Not Now
de: Nicht jetzt
ja: 後で
pt_br: Agora não
ru: Не сейчас
zh_hans: 稍后

# ChatAgent.RequestFailed
source: **Request failed** %@
de: **Anfrage fehlgeschlagen** %@
ja: **リクエストが失敗しました** %@
pt_br: **Falha na solicitação** %@
ru: **Запрос не выполнен** %@
zh_hans: **请求失败** %@

# ChatAgent.TextTooLong
source: 🛑 The text to analyze was too long. Select a portion of it and try again.
de: 🛑 Der zu analysierende Text war zu lang. Wählen Sie einen Teil davon aus und versuchen Sie es erneut.
ja: 🛑 解析するテキストが長すぎます。一部を選択してもう一度お試しください。
pt_br: 🛑 O texto a analisar era muito longo. Selecione uma parte dele e tente novamente.
ru: 🛑 Текст для анализа оказался слишком длинным. Выделите его часть и повторите попытку.
zh_hans: 🛑 要分析的文本过长。请选择部分内容后再次尝试。

# ChatAgent.TurnOn
source: Turn On
de: Einschalten
ja: オンにする
pt_br: Ativar
ru: Включить
zh_hans: 开启

# ChatCellView.AITyping
source: AI is typing…
de: KI schreibt…
ja: AI が入力中…
pt_br: A IA está digitando…
ru: ИИ печатает…
zh_hans: AI正在输入中…

# ChatClient.AnnotatedBullet
source: I [annotated](%1$@) “%2$@”: %3$@
de: Ich habe „%2$@“ [kommentiert](%1$@): %3$@
ja: 「%2$@」に[注釈を付けました](%1$@): %3$@
pt_br: Eu [anotei](%1$@) “%2$@”: %3$@
ru: Я [аннотировал](%1$@) «%2$@»: %3$@

# ChatClient.RevealAnnotationHint
source: You can click on a link in this message or on a yellow underline in the terminal to reveal an annotation.
de: Sie können auf einen Link in dieser Nachricht oder auf eine gelbe Unterstreichung im Terminal klicken, um eine Kommentierung anzuzeigen.
ja: このメッセージ内のリンク、またはターミナル内の黄色い下線をクリックすると、注釈が表示されます。
pt_br: Você pode clicar em um link nesta mensagem ou em um sublinhado amarelo no terminal para revelar uma anotação.
ru: Вы можете щёлкнуть по ссылке в этом сообщении или по жёлтому подчёркиванию в терминале, чтобы показать аннотацию.
zh_hans: 你可以点击这条消息中的链接，或点击终端中的黄色下划线来显示注释。

# ChatClient.WillNotExecute
source: AI will not execute this command.
de: Die KI wird diesen Befehl nicht ausführen.
ja: AI はこのコマンドを実行しません。
pt_br: A IA não executará este comando.
ru: ИИ не будет выполнять эту команду.
zh_hans: AI不会执行此命令。

# ChatFindBarView.CloseAccessibility
source: Close find bar
de: Suchleiste schließen
ja: 検索バーを閉じる
pt_br: Fechar barra de busca
ru: Закрыть панель поиска
zh_hans: 关闭查找栏

# ChatFindBarView.Counter
source: %1$lld of %2$lld
de: %1$lld von %2$lld
ja: %1$lld / %2$lld
pt_br: %1$lld de %2$lld
ru: %1$lld из %2$lld

# ChatFindBarView.FindNextAccessibility
source: Find Next
de: Weitersuchen
ja: 次を検索
pt_br: Buscar próximo
ru: Найти следующее
zh_hans: 查找下一个

# ChatFindBarView.FindPreviousAccessibility
source: Find Previous
de: Rückwärts suchen
ja: 前を検索
pt_br: Buscar anterior
ru: Найти предыдущее
zh_hans: 查找上一个

# ChatFindBarView.ModeIgnoreCase
source: Ignore Case
de: Groß-/Kleinschreibung ignorieren
ja: 大文字と小文字を区別しない
pt_br: Ignorar maiúsculas/minúsculas
ru: Без учёта регистра
zh_hans: 忽略大小写

# ChatFindBarView.ModeMatchCase
source: Match Case
de: Groß-/Kleinschreibung beachten
ja: 大文字と小文字を区別する
pt_br: Diferenciar maiúsculas/minúsculas
ru: С учётом регистра
zh_hans: 匹配大小写

# ChatFindBarView.ModeRegularExpression
source: Regular Expression
de: Regulärer Ausdruck
ja: 正規表現
pt_br: Expressão regular
ru: Регулярное выражение
zh_hans: 正则表达式

# ChatFindBarView.ModeSmartCase
source: Smart Case
de: Intelligente Groß-/Kleinschreibung
ja: スマートケース
pt_br: Maiúsculas inteligentes
ru: Умный учёт регистра
zh_hans: 智能大小写

# ChatFindBarView.NoResults
source: No results
de: Keine Ergebnisse
ja: 結果なし
pt_br: Nenhum resultado
ru: Нет результатов
zh_hans: 无结果

# ChatFindBarView.SearchPlaceholder
source: Find in Conversation
de: In Unterhaltung suchen
ja: 会話内を検索
pt_br: Buscar na conversa
ru: Поиск в переписке
zh_hans: 在对话中查找

# ChatInputView.AddManyAttachments
source: Add the %lld dropped files to your message as attachments, or insert their paths as text?
de: Die %lld abgelegten Dateien als Anhänge zu Ihrer Nachricht hinzufügen oder ihre Pfade als Text einfügen?
ja: ドロップされた %lld 個のファイルをメッセージに添付として追加しますか？それともパスをテキストとして挿入しますか？
pt_br: Adicionar os %lld arquivos arrastados à sua mensagem como anexos ou inserir os caminhos deles como texto?
ru: Добавить %lld перетащенных файлов в сообщение как вложения или вставить их пути в виде текста?
zh_hans: 将这 %lld 个拖入的文件作为附件添加到消息中，还是将其路径作为文本插入？

# ChatInputView.AddOneAttachment
source: Add “%@” to your message as an attachment, or insert its path as text?
de: „%@“ als Anhang zu Ihrer Nachricht hinzufügen oder ihren Pfad als Text einfügen?
ja: 「%@」をメッセージに添付として追加しますか？それともパスをテキストとして挿入しますか？
pt_br: Adicionar “%@” à sua mensagem como anexo ou inserir seu caminho como texto?
ru: Добавить «%@» в сообщение как вложение или вставить его путь в виде текста?
zh_hans: 是否将“%@”作为附件添加到消息中，或将其路径作为文本输入？

# ChatInputView.Attach
source: Attach
de: Anhängen
ja: 添付
pt_br: Anexar
ru: Прикрепить
zh_hans: 附加

# ChatInputView.AttachFileHeading
source: Attach File?
de: Datei anhängen?
ja: ファイルを添付しますか？
pt_br: Anexar arquivo?
ru: Прикрепить файл?
zh_hans: 附加文件？

# ChatInputView.AttachFiles
source: Attach files
de: Dateien anhängen
ja: ファイルを添付
pt_br: Anexar arquivos
ru: Прикрепить файлы
zh_hans: 附加文件

# ChatInputView.AttachFilesHeading
source: Attach Files?
de: Dateien anhängen?
ja: ファイルを添付しますか？
pt_br: Anexar arquivos?
ru: Прикрепить файлы?
zh_hans: 附加文件？

# ChatInputView.AttachmentNotSupported
source: Attachment not supported
de: Anhang nicht unterstützt
ja: 添付ファイルに対応していません
pt_br: Anexo não suportado
ru: Вложение не поддерживается
zh_hans: 附件不受支持

# ChatInputView.AttachmentsNotSupported
source: Attachments not supported
de: Anhänge nicht unterstützt
ja: 添付ファイルに対応していません
pt_br: Anexos não suportados
ru: Вложения не поддерживаются
zh_hans: 附件不受支持

# ChatInputView.CurrentProvider
source: the current AI provider
de: der aktuelle KI-Anbieter
ja: 現在の AI プロバイダー
pt_br: o provedor de IA atual
ru: текущий поставщик ИИ
zh_hans: 当前 AI 提供者

# ChatInputView.InsertPath
source: Insert Path
de: Pfad einfügen
ja: パスを挿入
pt_br: Inserir caminho
ru: Вставить путь
zh_hans: 插入路径

# ChatInputView.Placeholder
source: Type a message…
de: Nachricht eingeben…
ja: メッセージを入力…
pt_br: Digite uma mensagem…
ru: Введите сообщение…
zh_hans: 输入消息…

# ChatInputView.PlaceholderMention
source: Type a message, or @ to mention a session…
de: Nachricht eingeben oder @, um eine Sitzung zu erwähnen…
ja: メッセージを入力するか、@ でセッションをメンション…
pt_br: Digite uma mensagem, ou @ para mencionar uma sessão…
ru: Введите сообщение или @, чтобы упомянуть сессию…
zh_hans: 输入消息，或输入 @ 提及某个会话…

# ChatInputView.SendAccessibility
source: Send
de: Senden
ja: 送信
pt_br: Enviar
ru: Отправить
zh_hans: 发送

# ChatInputView.StopAccessibility
source: Stop
de: Stopp
ja: 停止
pt_br: Parar
ru: Остановить
zh_hans: 停止

# ChatInputView.SubmitHint
source: ↩ to submit
de: ↩ zum Senden
ja: ↩ で送信
pt_br: ↩ para enviar
ru: ↩ для отправки
zh_hans: ↩ 提交

# ChatInputView.UnsupportedAttachmentBody
source: %1$@ doesn’t accept this file type as a chat attachment: %2$@.
de: %1$@ akzeptiert diesen Dateityp nicht als Chat-Anhang: %2$@.
ja: %1$@ はこのファイルタイプをチャットの添付ファイルとして受け付けません: %2$@。
pt_br: %1$@ não aceita este tipo de arquivo como anexo de chat: %2$@.
ru: %1$@ не принимает этот тип файла как вложение чата: %2$@.
zh_hans: %1$@ 不接受此文件类型作为聊天附件：%2$@。

# ChatListViewController.DeleteChatsMenu
source: Delete %lld Chats
de: %lld Chats löschen
ja: %lld 件のチャットを削除
pt_br: Apagar %lld conversas
ru: Удалить %lld чата
zh_hans: 删除 %lld 个对话

# ChatListViewController.RenameChat
source: Rename Chat
de: Chat umbenennen
ja: チャット名を変更
pt_br: Renomear chat
ru: Переименовать чат
zh_hans: 重命名聊天

# ChatMentionPickerController.Window
source: Window %d
de: Fenster %d
ja: ウィンドウ %d
pt_br: Janela %d
ru: Окно %d
zh_hans: 窗口 %d

# ChatMentionPickerController.Workgroup
source: Workgroup
de: Arbeitsgruppe
ja: ワークグループ
pt_br: Grupo de trabalho
ru: Рабочая группа
zh_hans: 工作组

# ChatProviderBinding.ProviderMismatch
source: This chat uses “%1$@”, and “%2$@” belongs to a different AI provider. A chat cannot change providers once the conversation has started; start a new chat to use “%3$@”.
de: Dieser Chat verwendet „%1$@“, und „%2$@“ gehört zu einem anderen KI-Anbieter. Ein Chat kann den Anbieter nach Beginn der Unterhaltung nicht mehr wechseln. Starten Sie einen neuen Chat, um „%3$@“ zu verwenden.
ja: このチャットは「%1$@」を使用しています。「%2$@」は別の AI プロバイダーに属しています。会話が開始された後はチャットのプロバイダーを変更できません。「%3$@」を使用するには新しいチャットを開始してください。
pt_br: Este chat usa “%1$@”, e “%2$@” pertence a um provedor de IA diferente. Um chat não pode trocar de provedor depois que a conversa começa; inicie um novo chat para usar “%3$@”.
ru: Этот чат использует «%1$@», а «%2$@» относится к другому поставщику ИИ. Чат не может сменить поставщика после начала беседы; чтобы использовать «%3$@», начните новый чат.
zh_hans: 此聊天使用“%1$@”，而“%2$@”属于其他AI提供商。一旦对话开始，聊天无法更换提供商；请开始新对话以使用“%3$@”。

# ChatSessionMentionAttachment.SessionAccessibility
source: iTerm2 session
de: iTerm2-Sitzung
ja: iTerm2 セッション
pt_br: Sessão do iTerm2
ru: Сессия iTerm2
zh_hans: iTerm2 会话

# ChatSessionMentionAttachment.UntitledSession
source: Untitled session
de: Unbenannte Sitzung
ja: 無題のセッション
pt_br: Sessão sem título
ru: Сессия без названия
zh_hans: 无标题会话

# ChatToolbar.EffortHigh
source: High
de: Hoch
ja: 高
pt_br: Alto
ru: Высокий
zh_hans: 高

# ChatToolbar.EffortLabel
source: Effort: %@
de: Aufwand: %@
ja: 労力: %@
pt_br: Esforço: %@
ru: Усилие: %@
zh_hans: 强度：%@

# ChatToolbar.EffortLow
source: Low
de: Niedrig
ja: 低
pt_br: Baixo
ru: Низкий
zh_hans: 低

# ChatToolbar.EffortMedium
source: Medium
de: Mittel
ja: 中
pt_br: Médio
ru: Средний
zh_hans: 中

# ChatToolbar.EffortNone
source: None
de: Keine
ja: なし
pt_br: Nenhum
ru: Нет
zh_hans: 无

# ChatToolbar.EffortXHigh
source: XHigh
de: XHoch
ja: 超高
pt_br: Muito alto
ru: Экстра-высокий
zh_hans: 极高

# ChatToolbar.LlamaLocal
source: Llama (Local)
de: Llama (lokal)
ja: Llama (ローカル)
ru: Llama (локально)

# ChatToolbar.ModelFixed
source: The model is fixed after the chat starts.
de: Das Modell ist nach Beginn des Chats festgelegt.
ja: チャット開始後はモデルを変更できません。
pt_br: O modelo fica fixo depois que o chat começa.
ru: Модель фиксируется после начала чата.
zh_hans: 聊天开始后模型将固定。

# ChatToolbar.ModelOnlyOne
source: Only one model is available for this chat.
de: Für diesen Chat ist nur ein Modell verfügbar.
ja: このチャットで利用できるモデルは 1 つだけです。
pt_br: Apenas um modelo está disponível para este chat.
ru: Для этого чата доступна только одна модель.
zh_hans: 此聊天只有一个可用模型。

# ChatToolbar.ModelSelect
source: Select a model for this chat.
de: Wählen Sie ein Modell für diesen Chat aus.
ja: このチャットのモデルを選択してください。
pt_br: Selecione um modelo para este chat.
ru: Выберите модель для этого чата.
zh_hans: 为此聊天选择模型。

# ChatToolbar.ModelSelectProviderFixed
source: Select a model for this chat. The provider is fixed after the chat is created.
de: Wählen Sie ein Modell für diesen Chat aus. Der Anbieter ist nach dem Erstellen des Chats festgelegt.
ja: このチャットのモデルを選択してください。チャット作成後はプロバイダーを変更できません。
pt_br: Selecione um modelo para este chat. O provedor fica fixo depois que o chat é criado.
ru: Выберите модель для этого чата. Поставщик фиксируется после создания чата.
zh_hans: 为此聊天选择模型。聊天创建后提供者将固定。

# ChatToolbar.ProviderFallback
source: Provider
de: Anbieter
ja: プロバイダー
pt_br: Provedor
ru: Поставщик
zh_hans: 提供者

# ChatToolbar.ProviderFixed
source: The provider is fixed after the first real message in a chat.
de: Der Anbieter ist nach der ersten echten Nachricht in einem Chat festgelegt.
ja: チャットで最初のメッセージが送信された後はプロバイダーを変更できません。
pt_br: O provedor fica fixo depois da primeira mensagem real em um chat.
ru: Поставщик фиксируется после первого настоящего сообщения в чате.
zh_hans: 聊天中的第一条真实消息发出后，提供者将固定。

# ChatToolbar.ProviderSelectBeforeSend
source: Select the AI provider for this chat before sending the first message.
de: Wählen Sie den KI-Anbieter für diesen Chat aus, bevor Sie die erste Nachricht senden.
ja: 最初のメッセージを送信する前に、このチャットの AI プロバイダーを選択してください。
pt_br: Selecione o provedor de IA para este chat antes de enviar a primeira mensagem.
ru: Выберите поставщика ИИ для этого чата перед отправкой первого сообщения.
zh_hans: 在发送第一条消息之前，为此聊天选择 AI 提供者。

# ChatToolbar.ReasoningEffortTooltip
source: Select reasoning effort for models that support it
de: Denkaufwand für Modelle auswählen, die dies unterstützen
ja: 対応しているモデルの推論労力を選択
pt_br: Selecione o esforço de raciocínio para os modelos que oferecem suporte
ru: Выберите уровень усилий на размышление для моделей, которые это поддерживают
zh_hans: 为支持该功能的模型选择推理强度

# ChatToolbar.ServiceTierTooltip
source: Select OpenAI service tier. Priority is faster; Flex is lower-cost and slower.
de: OpenAI-Diensttarif auswählen. Priorität ist schneller; Flex ist günstiger und langsamer.
ja: OpenAI のサービスティアを選択してください。Priority は高速、Flex は低コストで低速です。
pt_br: Selecione o nível de serviço da OpenAI. Priority é mais rápido; Flex tem custo menor e é mais lento.
ru: Выберите уровень обслуживания OpenAI. Priority — быстрее; Flex — дешевле и медленнее.
zh_hans: 选择 OpenAI 服务层级。Priority 更快；Flex 成本更低但更慢。

# ChatToolbar.ThinkingAccessibility
source: Enable high-effort reasoning?
de: Denken mit hohem Aufwand aktivieren?
ja: 高負荷の推論を有効にしますか？
pt_br: Ativar raciocínio de alto esforço?
ru: Включить рассуждения с высоким уровнем усилий?
zh_hans: 启用高强度推理？

# ChatToolbar.ThinkingTooltip
source: Enable high-effort reasoning? Slower but may produce better results.
de: Denken mit hohem Aufwand aktivieren? Langsamer, kann aber bessere Ergebnisse liefern.
ja: 高負荷の推論を有効にしますか？ 遅くなりますが、より良い結果が得られる場合があります。
pt_br: Ativar raciocínio de alto esforço? Mais lento, mas pode produzir resultados melhores.
ru: Включить рассуждения с высоким уровнем усилий? Медленнее, но может дать более качественные результаты.
zh_hans: 启用高强度推理？较慢，但可能产生更好的结果。

# ChatToolbar.TierFlex
source: Flex (Slow)
de: Flex (langsam)
ja: Flex (低速)
pt_br: Flex (lento)
ru: Flex (медленно)
zh_hans: 灵活（慢速）

# ChatToolbar.TierLabel
source: Tier: %@
de: Tarif: %@
ja: ティア: %@
pt_br: Nível: %@
ru: Уровень: %@
zh_hans: 层级：%@

# ChatToolbar.TierPriority
source: Priority (Fast)
de: Priorität (schnell)
ja: Priority (高速)
pt_br: Priority (rápido)
ru: Priority (быстро)
zh_hans: 优先（快速）

# ChatToolbar.Title
source: AI Chat
de: KI-Chat
ja: AI チャット
pt_br: Chat de IA
ru: Чат с ИИ
zh_hans: AI 聊天

# ChatToolbar.WebSearchAccessibility
source: Web search image
de: Websuche-Bild
ja: ウェブ検索の画像
pt_br: Imagem de busca na web
ru: Значок веб-поиска
zh_hans: 网页搜索图像

# ChatToolbar.WebSearchTooltip
source: Allow AI to perform web search?
de: KI erlauben, eine Websuche durchzuführen?
ja: AI がウェブ検索を実行することを許可しますか？
pt_br: Permitir que a IA faça buscas na web?
ru: Разрешить ИИ выполнять поиск в интернете?
zh_hans: 允许 AI 执行网页搜索？

# ChatViewController.AIChat
source: AI Chat
de: KI-Chat
ja: AI チャット
pt_br: Chat de IA
ru: Чат с ИИ
zh_hans: AI 聊天

# ChatViewController.AllowControlSessionPrompt
source: **Allow agent to control session “%1$@”?** %2$@
de: **Agent erlauben, die Sitzung „%1$@“ zu steuern?** %2$@
ja: **エージェントにセッション「%1$@」の制御を許可しますか？** %2$@
pt_br: **Permitir que o agente controle a sessão “%1$@”?** %2$@
ru: **Разрешить агенту управлять сессией «%1$@»?** %2$@
zh_hans: **允许代理控制会话“%1$@”？** %2$@

# ChatViewController.AllowControlWorkgroupPrompt
source: **Allow agent to control workgroup “%1$@”?** %2$@
de: **Agent erlauben, die Arbeitsgruppe „%1$@“ zu steuern?** %2$@
ja: **エージェントにワークグループ「%1$@」の制御を許可しますか？** %2$@
pt_br: **Permitir que o agente controle o grupo de trabalho “%1$@”?** %2$@
ru: **Разрешить агенту управлять рабочей группой «%1$@»?** %2$@
zh_hans: **允许代理控制工作组“%1$@”？** %2$@

# ChatViewController.AllowOnce
source: Allow Once
de: Einmal erlauben
ja: 一度だけ許可
pt_br: Permitir uma vez
ru: Разрешить один раз
zh_hans: 允许一次

# ChatViewController.AllowRepeatedReadsPrompt
source: **Allow repeated screen reads?** %@
de: **Wiederholte Bildschirmzugriffe erlauben?** %@
ja: **画面の繰り返し読み取りを許可しますか？** %@
pt_br: **Permitir leituras repetidas da tela?** %@
ru: **Разрешить повторные чтения экрана?** %@
zh_hans: **允许重复读取屏幕内容？** %@

# ChatViewController.AlwaysAllow
source: Always Allow
de: Immer erlauben
ja: 常に許可
pt_br: Permitir sempre
ru: Всегда разрешать
zh_hans: 始终允许

# ChatViewController.AlwaysDeny
source: Always Deny
de: Immer verweigern
ja: 常に拒否
pt_br: Recusar sempre
ru: Всегда запрещать
zh_hans: 始终拒绝

# ChatViewController.Approve
source: Approve
de: Genehmigen
ja: 承認
pt_br: Aprovar
ru: Одобрить
zh_hans: 批准

# ChatViewController.AskEachTime
source: Ask Each Time
de: Jedes Mal fragen
ja: 毎回確認する
pt_br: Perguntar sempre
ru: Спрашивать каждый раз
zh_hans: 每次询问

# ChatViewController.ConfirmChange
source: Confirm Change
de: Änderung bestätigen
ja: 変更の確認
pt_br: Confirmar alteração
ru: Подтвердить изменение
zh_hans: 确认更改

# ChatViewController.DeleteChatConfirmMessage
source: Are you sure you want to delete this chat? This action cannot be undone.
de: Möchten Sie diesen Chat wirklich löschen? Diese Aktion kann nicht rückgängig gemacht werden.
ja: このチャットを削除してもよろしいですか？ この操作は取り消せません。
pt_br: Tem certeza de que deseja apagar este chat? Esta ação não pode ser desfeita.
ru: Вы уверены, что хотите удалить этот чат? Это действие нельзя отменить.
zh_hans: 确定要删除此聊天吗？此操作无法撤销。

# ChatViewController.DeleteChatHeading
source: Delete Chat?
de: Chat löschen?
ja: チャットを削除しますか？
pt_br: Apagar chat?
ru: Удалить чат?
zh_hans: 删除聊天？

# ChatViewController.Deny
source: Deny
de: Verweigern
ja: 拒否
pt_br: Recusar
ru: Отклонить
zh_hans: 拒绝

# ChatViewController.DenyThisTime
source: Deny this Time
de: Diesmal verweigern
ja: 今回は拒否
pt_br: Recusar desta vez
ru: Отклонить в этот раз
zh_hans: 本次拒绝

# ChatViewController.DisableOrchestration
source: Disable Orchestration
de: Orchestrierung deaktivieren
ja: オーケストレーションを無効化
pt_br: Desativar orquestração
ru: Отключить оркестрацию
zh_hans: 停用 Orchestration

# ChatViewController.EnableOrchestration
source: Enable Orchestration
de: Orchestrierung aktivieren
ja: オーケストレーションを有効化
pt_br: Ativar orquestração
ru: Включить оркестрацию
zh_hans: 启用 Orchestration

# ChatViewController.EnableOrchestrationModeBody
source: Orchestration mode lets the agent coordinate across any iTerm2 sessions. It can read screen contents from any session, but to type into a session requires your permission. This is a more permissive model than when an agent is linked to a single session, where there are very fine-grained permission settings. Enabling will detach any linked terminal or browser session and switch the chat to Orchestration mode.
de: Im Orchestrierungsmodus kann der Agent die Koordination über beliebige iTerm2-Sitzungen hinweg übernehmen. Er kann Bildschirminhalte aus jeder Sitzung lesen, benötigt jedoch Ihre Erlaubnis, um in eine Sitzung zu tippen. Dies ist ein großzügigeres Modell als wenn ein Agent mit einer einzelnen Sitzung verknüpft ist, wo es sehr feingranulare Berechtigungseinstellungen gibt. Durch die Aktivierung wird jede verknüpfte Terminal- oder Browser-Sitzung getrennt und der Chat in den Orchestrierungsmodus umgeschaltet.
ja: オーケストレーションモードでは、エージェントが任意の iTerm2 セッションをまたいで連携できます。どのセッションの画面内容も読み取れますが、セッションへの入力には許可が必要です。これは、エージェントが単一のセッションにリンクされている場合よりも制限の緩いモデルです。単一セッションへのリンクでは、非常に細かい権限設定が可能です。 有効にすると、リンクされているターミナルセッションまたはブラウザセッションが解除され、チャットはオーケストレーションモードに切り替わります。
pt_br: O modo de orquestração permite que o agente coordene entre quaisquer sessões do iTerm2. Ele pode ler o conteúdo da tela de qualquer sessão, mas para digitar em uma sessão é necessária a sua permissão. Este é um modelo mais permissivo do que quando um agente está vinculado a uma única sessão, que possui ajustes de permissão muito granulares. Ativar desvinculará qualquer sessão de terminal ou de navegador vinculada e mudará o chat para o modo de orquestração.
ru: Режим оркестрации позволяет агенту координировать работу с любыми сессиями iTerm2. Он может считывать содержимое экрана любой сессии, но для ввода текста в сессию требуется ваше разрешение. Эта модель более разрешительная, чем когда агент привязан к одной сессии, где настройки разрешений гораздо более детальные. Включение этого режима отсоединит любую связанную сессию терминала или браузера и переключит чат в режим оркестрации.
zh_hans: Orchestration 模式可让智能体跨任意 iTerm2 会话进行协调。它可以读取任何会话的屏幕内容，但要向会话中输入文字则需要你的许可。这种模式比智能体关联到单个会话时更加宽松，后者具有非常细粒度的权限设置。 启用后将取消关联任何已链接的终端或浏览器会话，并将聊天切换到 Orchestration 模式。

# ChatViewController.EnableOrchestrationModeTitle
source: Enable orchestration mode?
de: Orchestrierungsmodus aktivieren?
ja: オーケストレーションモードを有効にしますか？
pt_br: Ativar o modo de orquestração?
ru: Включить режим оркестрации?
zh_hans: 启用 Orchestration 模式？
